<?php

use Phinx\Seed\AbstractSeed;

class Stages extends AbstractSeed
{
    public function run()
    {
        $data = [
            [
                'id' => 1,
                'name' => 'Новый клиент'
            ],
            [
                'id' => 2,
                'name' => 'Привязка номера телефона',
                'description' => 'Приветствие пользователя и получение кнопки для сохранения номера'
            ],
            [
                'id' => 3,
                'name' => 'Начало работы',
                'description' => 'Приветствие пользователя и получение кнопки для нового платежа'
            ],
            [
                'id' => 4,
                'name' => 'Секции',
                'description'=>'Предложение выбрать пункт меню'
            ],
            [
                'id' => 5,
                'name' => 'Операторы'
            ],
            [
                'id' => 6,
                'name' => 'Сервисы'
            ],
            [
                'id' => 7,
                'name' => 'Айтемы',
                'description'=>'Предложение выбрать айтем'
            ],
            [
                'id' => 8,
                'name' => 'Поля ввода',
                'description'=>'Вывод полей ввода для айтема'
            ],
            [
                'id' => 9,
                'name' => 'Верификация'
            ],
            [
                'id' => 10,
                'name' => 'Правила комиссий',
                'description'=>'Вывод клиенту правил комиссий по айтему и текущему времени'
            ],
            [
                'id' => 11,
                'name' => 'Сумма платежа'
            ],
            [
                'id' => 12,
                'name' => 'Подсчет комиссии'
            ],
            [
                'id' => 13,
                'name' => 'Платежная страница'
            ],
            [
                'id' => 14,
                'name' => 'Pay',
                'description'=>'Проведение платежа'
            ],
            [
                'id' => 15,
                'name' => 'Check',
                'description'=>'Проверка статуса оплаты'
            ],
            [
                'id' => 16,
                'name' => 'Cheque',
                'description'=>'Шаблон чека'
            ],
            [
                'id' => 17,
                'name' => 'Поиск',
                'description'=>'Поиск айтемов по введенному, клиентом, сообщении'
            ],
            [
                'id' => 18,
                'name' => 'Дефолтный ответ',
                'description'=>'Если больше никаких ответов не найдено'
            ],
            [
                'id' => 19,
                'name' => 'Личный кабинет',
                'description'=>'Управление картами, историями платежей'
            ],
            [
                'id' => 20,
                'name' => 'Управление картами',
                'description'=>'добавление и удаление карт'
            ]
            ,
            [
                'id' => 21,
                'name' => 'Главное меню',
                'description'=>''
            ]
        ];

        $this->table('stages')->insert($data)->save();
    }
}
